; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 345404 1 1 2 6 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image1 - mode
	image0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(have_image Planet6 image0)
	(have_image Star7 image0)
	(have_image Star8 image1)
	(have_image Planet9 image1)
	(have_image Star10 image0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 groundstation2 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 star7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
5. (take_image satellite0 star7 instrument0 image0)
   added: (have_image star7 image0)
   goals met: 1 of 6
6. (turn_to satellite0 star10 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star10)
   goals met: 1 of 6
7. (take_image satellite0 star10 instrument0 image0)
   added: (have_image star10 image0)
   goals met: 2 of 6
8. (turn_to satellite0 planet9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet9)
   goals met: 2 of 6
9. (take_image satellite0 planet9 instrument0 image1)
   added: (have_image planet9 image1)
   goals met: 3 of 6
10. (turn_to satellite0 planet6 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet6)
   goals met: 3 of 6
11. (take_image satellite0 planet6 instrument0 image0)
   added: (have_image planet6 image0)
   goals met: 4 of 6
12. (turn_to satellite0 groundstation4 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation4)
   goals met: 5 of 6
13. (turn_to satellite0 star8 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star8)
   goals met: 4 of 6
14. (take_image satellite0 star8 instrument0 image1)
   added: (have_image star8 image1)
   goals met: 5 of 6
15. (turn_to satellite0 groundstation4 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation4)
   goals met: 6 of 6
